node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7173523
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "%\357\273\275P\250\205=S\225\205\276\324\374\"<+\265\020\276Z7\201\275b\320\217\276\366\345\024>\340bA>w\332\227\275S\256\025\276$\251\034>\233v\223\275\007\364\364\274;\337\305=\245u\201\276\310\020{=\237\225*\273\205\231\036>\354\035\200\276.A\001\275\372\324\255\275\017w\361=4\340\306=\366\341$\276\001\212\265\275U\204\376=[\231\206<\226#\010>\022\306\372\272\313\033j=\327\027\201\276\257\355\352\275p\001N>\010I\257\275M\007\356=5L\376=\361xA>\257gP\275gz\216\275\035O\213<0\026t<2dI>\300]p\276\345\311D=\30307=\367\020V\275\201\341\013<\330\014L\275\270u\003\276\204@\007\275\2201\201=\354w\260\275\253[\224\275\247\276\001>`\200}=\247r\323\275\303\235/\276\265wH=\265\016N\276Y\377\212\276\267_U=A\322\003=42K\276G\333\345:\327\257\376<\345|u=F$\240<;\317[=I_#>\236\n7\274L\360\270<\215P =``t\275\304\276Y>\275\002[=\024\217\357\274\033\327\275\276\303(\214\276e\243\004\276CR,\276\276\371:\276U\321\n=\357v\315\275\242\021\332\275\014 d\275\350\345\020\276\306Fd\276d\\\306\274\225\324,\275\366\000\021< \017;\275\342\002\n\276\263\201I<}\250\206>|\022\251=^\307\347=?wT\276\312z1\274P^\223>xX\244<\004\024\305\274\032\314\316\275\271\202\\\273@j\033\276\27520>\342=\321\274\234\216+>\20763>\\n\311\2754J\271\275cM\034\275xeC;\205\313\234\274T`\311=<D\037\274\033M\265\275hh{\274\t\324\317=\261\335\231<\267\243\371\275\364u\032>\346J5>\317\221\304=\340\356\001>N\262r\275\316v*=\225R\233=\304Q\002\276V\357\033\275\002J\037>\314\327\325<\354\261\202=aD\324\274\031\364\"\276\003HE\275\356\030\003>\331\2072=\361\232;\276\315\371\252=i^\210\2758\357\351\273F&\343=\216o~=m\277\351\275(<c>\321\310a>\0040 \276e\271\027=\271\377\255>Q|)>\301B4\273&vK=7\267\250\275M}\234=\354\320\027\276N0\026\276\333W\032>\021\275\317\275H\234\304=\216]\365\275-\221J=\0236\n>ls\217\276\277~\351\275\037\201\250>\272\233\005\275\326\324\260<T\023V\276\017\373\311=\31282=\266 \005\276M\254\304\275}\257\334\274\237/\204\275\002\207A\275M\331\276\275@d\335=\255=\325;\234D\367\275\243ax\275.\214/=\356!@\2754\224\220=\005\256\223\275n5Y\276\232%\036\276h\255\352\275-\032\357=\034\022m\276|\022\326<\206\313q=\334\002\365\273\326\251D\276m/\005>9Ig=J\240\211\275\035\005\200=\303\314\222\275\370$\344\2754/\017\276M\032\204=\307\035\253\273\341x\026\276j\376*\276\"\rP>\340\366\367;s\201\317\272D\240{\276\373\332\261\276o\277\302\275pq\014=\200T9\276\014\347\005\276pQ\222=[\332\020\275:H\250\275B_)=!\372^>\270\265\t\276\203\233I\276\005\342!=3@\226=\004\037\310=D\202\311\275\310\272\001>\333rt=\236\272D\276\013\345\324<X\371\204>\325G\265=\270\210K=m\265\256=\021^\361\275.\371\244\275\326\334\201\276Q\373\345\275\033\332\325<\032\005T\275Y\3350\275\342\002\205\275\217\272\241<}\006\212\274\214T/>\315\257.>\r\237\300=\324\031@\276\302h\030=\252\373\230\275\025W\203=j\356\203>\367\314d\276\320\262\030>I%U=3 \266<\334\234\233\276\313]K\274\037\364\033\274\027z8\275\315\325\024>\002\2641=-\3103\276\356.Z\275\r\212\021\276#\016\355;\207|A\276&\3011\2764\266\253\2744\2601\275\000M\332\2740\343)\275aM\216\274\224\334\213\274\211\200\331\273\2071\343\273\177\370\032\276&\254\311\274O\020.\276hR/>\261\355\177\276\371\371\202\275:D\014>E\374\364=\311\324\253\275%)\236\275+h\223\273\242\303q=\272\231;\275\273\203\202\275\336eq\276\037\325\241>G\216\224=\373\253\250=$D(>\202qS>Q2\273\275U\032z\275o&\022\274L\230U>\225/5\274\367\302\352=\001\205\n\276\257O$<\025\004\264\275\324\254\306<\032\332\225>\331\376#\275\003XS\276\"#\245=hG\203\273\253aM>%6\216=V0\236\275\027D\006>\223\312C>q\242T>C(\241=R\327,>\"\334\213<bM\314\274\341\317@\276\232/h=\023av\274\230\365\377\274\375\250\263\276\207\030$\275\301\351\260=\362\312,\276\r\033\003>z\233d>\034<\034\276\026\027R\275\273$\217\274\261Y\037>\221\006\016>_\323\n\276\326rC>\336\311T=xB\340=\302j\216\275\372\335\311;\231Fb\276\356\333\261=R9\212=](>=\237\335V=\241\235\234\274jpi\275\201\263\236\274\330D\243\275w\203\032>\346x\237\275\320%4>x\340\315=\224\214#\275\322\366p\275\210_^>\005\017\217\275)+\"\276\315\326\017\275D\271\204>m(\267=\324C+\275\005\370\013=\005\314\331<\203q\016>yp\265:\001\236\036>L\223\231\274*\216&>\346B\270<m\007\233>RY\352=\233\2607\275Xf ;Z4\217=\030W\200=\331q\244=\312\331:\276\255\253\016>Me9\274vH\365\274\335\373\021>F\264o\276\325\301\t\276V\246\271\275\003CZ=\264\356\312=\332A\331=g\017\371\275\253\224\010>\263\210\004\276|\306\262=e\206\333\275\304\374E=\327\315E>\310\rT<\321\252E=\204\252]\276\020g\234\275\257\326\r\274\201b\215\275YE\261\273 \236\211>j\"\346\275?\352\024\275\377\335\203=\215\255\223\276\212b(=\033\2238\276\364\301\234\275\017\235@=!\234\330\275vl\271=\250\027r\275\274?\225\275\034S&\276\320\262\210>\211\270\262=\377!7\276\376\267\275\274s\034\366\275\256\331\342\274W\2752<\253v\337=\3473E>\247bF\275\352`\312=\0234\037>\264\205\200>Mgq>8\202C:\264#\007\2764\355\'\276\352\206\215=z\331\016\276o\353\240\275&\340\366=\026\030\217=^\277\013\276\240\355\007\276\017\240\324\275\367\202L>\016\360\021>\340\361\367=\247\354\034=W\300\204\275\326t{\275\206\001\030\276\302B\245=I\346z=\255\243\356\274.\274\255=w\231>=\333\266\341\275>\017\204\276\304\271\t\274\n\372!\275Ha\030\275\244)@=l@/\276\223\213\026>rH\242=q\r\\>\332\250\320\273+\262\035\275\353\354\260\275\356\335\204\276E\277\340=E\016\007>\241kP\276S}\016\276\313\375\261\273f\315\374\275yq\323=\024\tb>A\271,\276\350\022\250<\202\215\032\276$\2767>\265\343N\275\237\221\237=)\210R\274\254\337\232;\245\016\303=\350S\240\275\312\232]\276\314\301v\275E{\253\275G^\362=\030\330\203\276\206\252\'>\327\"\374\274+\334s>&\234\343=\014\217\270\275\265u_>g\210\254<\227-E=\207\224D\276X\261\240>=\362\237=\356\202\326=\227S0\275\301g\312\275zz\357<?\275\224=\3766N\276\\\242s\276\263\234\247=\307p\307\273\271\320\265>4\324x>\231\231\003\276{zg=8]\036=\211\2130\275\367X\364\275n\n\014>\350\025\030=W\366\016\276\005u\030\276\357\0130>~\360\341=\001\r\374=\366k\204:\355\"\356\273\332\2172\275b\023\212=9\204z\275\357~K\275\226R\237\274:\245\023\275V\022 \274\226\236\302=n\272\216=\014\320\305=\256\350\254=t\033\027>FC\n=\326\000^>\267\014\022\275I8\210\275\005\244\232>\000QE>\360\017\"\275rZ\370\273C\246\017>\003;\237=\362\347\345\275\324\017\211=K)P\275\215\022\375<\370o\243=\231S6>s\304\307=\227&\357\274\377\033:>\326\372:\276|=J<C\334\230\275W\357!=\320\351\321\275\355\200*\275\224\263\002>$\034\">\000\003\245\275\241u\025=o\327\202\276\252\301\214=\267\341\212\276\003\341\250\275Y\230\257<\023\271\332<\306\006\327\2753d\241=\337t\341<\333H\224\275%X1<\331\306\255>\026N\234\275(\371\222\274\240\'r=\315S\013\276D\200R\275]^\251\275W\277\354=H\030Q=sd\243=7\205\212\276cK\312\275q\264\200\275}\206\017\276\347_,\276G\022\262\275p\252t=XW\227=\016E+\276\224l\300<NFu\2760O\266\274\203\320\\\275U\352\277=\013\372S\275\340\245w=\'D\353\273X\201\371\272K\356L\275\323>\310=\035\271\333<\322\343\224\274;\237\343<O\316\255\274\nR\000\275\344M\210=I\336\272\274d\366\370:\354\357\262\275\234\234/>+\215\200>\016\366F=\376 \264=N+L=\334:\016\276\343^\356<\353\323?=9.|\276\260V-\275\312\0071\276\366$\201\275\202\244\001<\236,\365<?9\014\275\363\026\"=S\343\220=p<&>1\343\227<|\026\251>\242\252o=FGm\276fw9\276\\.j=`\341\253\275|~\000\276\336\265!<\234\204N>J\270b\276X\327\343=\036\374\235\275\353/\330\276\227\336\371\275f\t\252\2758{\246\272\035\232\037\276\270\242\215\275\203\345\325=\302\242\"=%UJ>X\341\202\276g)\375=\355`V>\026\223+<@NO=]$X\276\234\360~>\370\362\371\274D\216\250=dN\245\274\323\372:>o\025\237\2753\366\206=\321]\032\276\354\276\353\275\211Rt\275\313\211\273=$\326O>M\225+>\217\237o\275\211\265\327\275\243G\357\275\235]x=O\222\334\275\333\274d<\316\364\202=UE]>>[\353\275\224i\262>+%\022\275\226\344\010\274\255\017\023\276>3\026>\350\203\304=\302m}=\256Z\227\274\267\250\001>\310\220\262\272\303\005&\276p\017J\275\240\264\273\274h:\177\275x\016D\275D\207#=\355\350l\274\366\017U\276\201s\023>nU\017\275b\275\224\275H\376!\276\215\251\201\275\257\260a\276\247]\323\275}\2660>c~\177=\263R\271<$\352\016>7\265|\276Q$\336\275?\303C\276:n\374\275\'E3=\345\332\004\276I-X\274#x=>\032\336n\275\363IC>\254M\376\275\211\361\352\273\333\224\227>RzY\276\022\222V\275r\362\371=\3368\211>\223_\260<t\275\217\276\n\315\240\273;\242/>y(\263\275u~6<\364\275c\272}\016\233=\2667\002>\212 \273<\262\300\217\275|\023U=G>\253\275.\021\337\274-)E\275\262\'$=\226\214\r\2767,,=\372\300\243\273H\270\253=\202\271Z\276\311\014\211\275\n\204\033\276\177\367\223<\347\361h>\'J\006\274\265A/>?(]<m\356h>Sh~\276\326\230\367=<\363\232\274\022P\013>\n\'7\275K\270M==\242N\275\250K\354\275,\302\267\2745\356n\274\324\212o=M\">\275\206\255\376=n\254\207>\270\342\253=Px\364\275\241\276v\275>\rY\276\217X\016=-S\263<\000A\221>\323\210\237\275})\247=n\367S>\256\260\377\275 \235v=6\202\267<I\177\213>t\306\036>\033\264m\275\312D\255=<ZG\2760\004\003\276F\003\202\276\001\026k>\3273\244=Y\0343\275\351=+=\335\356\235=k\215\326=gI)>\266!\264<\215R\231\275\325q1\275\331\350\216=d)3<*8 >\315\032\271=BW\215==\332U\276xt\207\276#\324\n> \014\210=\362\3030>\224Z\264=\205?\317=\274?\036\276\256P\350=|\337\213\275\346\374\252\2758\030F>\007\334\260=\373\315M;\315\033\016\270\354d\311=\323\001\'>\272!\227=b\360\305\274\243\013\214=1q\342<\345\363\275\275\234\244?>LA\344<\267\321#>\366,\373=\367\233$<\000 .\275s\334\335=\022C?>\363\315\207=E\213\002\275U_\177\275\217R\345\275R\260,\276e\353\325;\307\212;=&8\030>\342\301\177=\177\323\321\274\306po=t\222^>\354N\226={\272\365\275u`\013>\227\225D\274[2+\276\246\001\211<\277k\264=oH\"\276\327\227\275<np\376\270\254\317\221;\360>\021\276\336\223\272=k\241\276\275\236~\324\274\277 \025>\217Ck\275\014A\004>\371DG=\342*;=j%?>\267*\216\276:\034\216>Z-\216\276Y\275[\274\026_\276=\357\306\250=[$\337\274\016\026@\276\253,\006>\255\001\311<{w\005\276\223\177\315\274$\032\037\276S\345\022>\261\324\255>p\006\314\273J\033\305;t\276\250\275\315&\202=\327\311\234=\362\372\237>\262N\323\275U\277\227=TON<\334\301i\274\365\203\317\275}\3258\276\330o0\275\245\201\336\275\207\031g\276\254\035\342=\237\346_>\260\321\215=\312\201\271\273\tUe>\201\034\363\275~\014\262\275\371P=\276\033_\260=\366\005\330=\212g\216=.\253\017>\240\001^>\316n\212\274$\3702\276\264\340\002>\313>\250\275U\234\237=\013\334\231\276\304\211\210=\206A\307=\375\317\255\274\335!B>\250\310\271\275:GE>p\003;>2\203b\275\221\210\215\275L\014\245=5<\263=C^\021=62\305\275u?\203\276R6\227<\362 \262<G%\314\275\211\302\177\273\037-(\275\366\214\202\275L\320\217\275ve\226=^\202\202;\332>\217=a\356\271\273\272\225\243=n)E\276\202\017\204\275E\257\265<\351\004\"\276\205\177\225>v\003+\276=#2\275}Zs\276\"a\204\275\254\324\324=\331\340@=\362\377m=\003\251\370={\255\034>\357\005\323\275\001\302\254\275\303\327\357\273t\237(>\271\324\220;\236\320\264\274k\345\257=VV\r\274\346\r\355\275\025\036\206=\033v\031\276RC\210>\211w\024>\252_\210=\225\232\'\275K\353h>\005\252e\274\273/\315=\254\234F>@\320\231\275\330\256}=\246\257P\276\321\257\327=\367\300\237<\355ov\275<L\351=F;\223=\353\271\360=1\373\020=\265\314\202\275\3248\360\276\035\345\213\275\232C\r\275\331\037M\276e\177\270\275\250\346\037\276%\264\250=\250\241\236<f\343\321\275\026_\010\275\324\013\036\276h2i\274r9+<\302\3616>I\345\315\275\246\304\303=*\343\356\275\336;\037>\024\202(\275\346\005\315=\017\317\231\276\357V\021\274\225\262)>\304&\200\272\330j;\2754*\020=\315^\'\274}3\211=\270\013r>+q\373\275\327\243\032\276px\025=\244\t\363=_u\014=\270\336b\276a\004\016\276+\331\332<\262O\010\276^#1=\343\350\322\275\221\231\265\275\352\211g\276\216\212N\275\004\233\347=\377\262\235\273\017Z\244=I\275\246=3vy=\260\021(\275\375Y\026\276\370jp>\2518\227=\n\013\025>|\221T>\361\326\"\276Ec\254\274\374\300\030=O\353w\275\242\330a>\206;\273= \250$=\331\302\231\275\241\023\220=\353\315\333=\212\236\361<z\336\346\274n{\245=\030\245\235=\264\236\201>3R\326\2756\237J=9\254\204\275\337\010\202\274\030\200\213>\001\234\t\276\2315\314=&\334,>\307\006\244=\362U\335<P\230\023>#\266\002>[\261@>\033\302?=T\001_>G\327\302=\214\220\007>\24020>d\304)\276\310\375\275<\310h\203\275\326F\227\274\022\203\237<\204\371Y=\023L\322=)/\000>\351z\\\276\324M\202={2\317\275Jy\246\276\273\302\316<F1\273>\320>Z\276\307x\310=_\000\344\275\005{\"=\214UF\275\322I\321</!\330=t\000\372\275\032\363<>\277\243\273=*\023\342\275&pE>3\376\275;\320\210\357=\230\374\235=\025#\362\275\177\221\232>{\340g:\251Q~=\325.\342\275j\227\">\320+\037>\303\362\014\274\245&B;X\220\361\274\245\202\007>G[\016<\323\366)>\301\343\270=j\277V=\024\016J>K\016N=\2556\263\275\346\215\031\276\201\317o\275\034#5\276\030m\325\273\216\246\315;\300\337\375\275\352_\251=\313\343\033\275\264s\273=\25063;\014*g\276\023\342\263\275\344\302\330=YA\017\276\202\237\017\274\324\0013<\025L\242>\315\204\221=\020\003\334\275\263\037\025\276\205\001\233=OO\365<\304\374\002>\223\n+\2757\344w<\252BZ\275\276>\001\276\314|\313\275|ML>\363\357\016\276\023\007\274\274\277\321\234=X\000\253=\323Z\201\275\342O7\275\337\270\200\275\205)\274< \362\244\275\005\216a=Vq$\276xz&\276\200\305&=\177@\301>-F\344=\n\305\217\276\024\230\217=\337\013b>\035\227+\276\344\273\336\275\341\203\307=]\304n\274Z<\005<.r1>:a2>\200[\241=\362\264\240<\027\226\241=[\360\361=\360\240\317\274>\312X>\201\010\016\276P\022\006\276k\216u\276\037\213\212\273\274*N\276\373\022\037>\355\000\250\271\032\177\2369mx\243:\301\035 \276\322z4=\007\332\371<\006\033\234=\234\357\261\273"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
